rails_end/app/controllers/api/ionic_end_controller.rb

    def all
      render json: User.all
---
SELECT "users".* FROM "users"