rails_end/app/controllers/api/ionic_end_controller.rb

    def all
      # render json: User.all,
      render json: Podcast.all
---
SELECT "podcasts".* FROM "podcasts"